---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetColorSettings
source: html/39084694-2f09-5348-d224-34bd26dcc63d.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetColorSettings Method

Get color settings object from the style.

## Syntax (C#)
```csharp
public AnalysisDisplayColorSettings GetColorSettings()
```